# -*- coding: utf-8 -*-

COLLEGES = {
    'Хабаровский колледж отраслевых технологий и сферы обслуживания':
        {"Дошкольное образование": "флегматик",
         "Коррекционная педагогика в начальном образовании": "сангвиник",
         "Музыкальное образование": "сангвиник",
         "Педагогика дополнительного образования": "меланхолик",
         "Преподавание в начальных классах": "холерик",
         "Специальное дошкольное образование": "сангвиник",
         "Гостиничный сервис": "флегматик",
         "Гостиничное дело": "сангвиник",
         "Профессиональное обучение (по отраслям)": "сангвиник",
         "Дизайн (по отраслям)": "холерик",
         "Изобразительное искусство и черчение": "холерик"}
}
# pprint.pprint(COLLEGES)
print(COLLEGES.keys())
# subjects = {"Дошкольное образование": "флегматик",
#             "Коррекционная педагогика в начальном образованииМузыкальное образование": "сангвиник",
#             "Педагогика дополнительного образования": "меланхолик",
#             "Преподавание в начальных классах": "холерик",
#             "Специальное дошкольное образование": "сангвиник",
#             "Гостиничный сервис": "флегматик",
#             "Гостиничное дело": "сангвиник",
#             "Профессиональное обучение (по отраслям)": "сангвиник",
#             "Дизайн (по отраслям)": "холерик",
#             "Изобразительное искусство и черчение": "холерик"}
#
# temp2 = ['флегматик', 'сангвиник', 'меланхолик', 'холерик', 'сангвиник',
#          'флегматик', 'сангвиник', 'сангвиник', 'холерик', 'холерик', 'меланхолик']
#
# for i in zip(subjects, temp2):
#     print(f'"{i[0]}": "{i[-1]}",')
